Autodesk.Revit.DB.Electrical.CircuitConnectionType
An enumerated type indicates the panel to panel connection type
Since:
2020

Autodesk.Revit.DB.Electrical.CircuitConnectionType.FeedThruLugs
FeedThruLugs.

Autodesk.Revit.DB.Electrical.CircuitConnectionType.Breaker
Breaker.

Autodesk.Revit.DB.Electrical.CircuitConnectionType.NotApplicable
NotApplicable.